num_layers: 80
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "TIDL_cast_in"
  layer_type: "TIDL_DataLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 0
    size: 1
    element_type: 0
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "TIDL_cast_in_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 1
  outputs {
    min: 0.166666657
    max: 250.166672
    size: 1
    element_type: 0
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "/encoder/features.0/features.0.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 3.22580266
    size: 1
    element_type: 1
    scale: 79.050094604492188
    zero_point: 4294967168
  }
  weights {
    min: -0.00653126324
    max: 0.00563414488
    size: 1
    element_type: 0
    scale: 19598.046875
    zero_point: 0
  }
  bias {
    min: -0.0783480778
    max: 0.765738547
    size: 32
    element_type: 0
    scale: 167.15888977050781
    zero_point: 0
    value: 4.1600123302656552e-39
    value: 0.24717423319816589
    value: 0.23394565284252167
    value: 0.29281061887741089
    value: 0.76573854684829712
    value: 0.50802308320999146
    value: 0.33066418766975403
    value: 0.34292775392532349
    value: 0.4102739691734314
    value: -3.9267158968847582e-10
    value: 4.5903679762604965e-31
    value: 0.2642720639705658
    value: 0.3602730929851532
    value: -0.0783480778336525
    value: -5.9328198176444857e-07
    value: -0.00032914296025410295
    value: 8.80299899184243e-40
    value: 2.3174365717341673e-39
    value: 0.1153809055685997
    value: 0.26988950371742249
    value: 0.10848631709814072
    value: 0.41697964072227478
    value: 0.15262039005756378
    value: 0.0029684589244425297
    value: 0.27199888229370117
    value: 0.29887878894805908
    value: -4.4275580424191219e-10
    value: 0.65105849504470825
    value: 8.6936472648803792e-39
    value: -0.075358279049396515
    value: 0.25175663828849792
    value: 0.0062970523722469807
  }
}
layers {
  layer_name: "/encoder/features.1/conv/conv.0/conv.0.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.38349628
    size: 1
    element_type: 1
    scale: 34.536483764648438
    zero_point: 4294967168
  }
  weights {
    min: -9.15253353
    max: 9.0222435
    size: 1
    element_type: 0
    scale: 13.985198974609375
    zero_point: 0
  }
  bias {
    min: -0.254261136
    max: 0.9990502
    size: 32
    element_type: 0
    scale: 128.12168884277344
    zero_point: 0
    value: -2.5099718978757757e-38
    value: 0.55534154176712036
    value: 0.4360923171043396
    value: 0.1774449497461319
    value: 0.18801838159561157
    value: 0.39813134074211121
    value: 0.48632943630218506
    value: 0.3665374219417572
    value: 0.46874061226844788
    value: 3.6590232254697652e-13
    value: -3.1257629791937591e-39
    value: 0.32224300503730774
    value: 0.39023816585540771
    value: -0.036741342395544052
    value: -0.0016863323980942369
    value: -0.0031032359693199396
    value: 4.6227426631820604e-38
    value: -1.9786864007085932e-38
    value: 0.695850133895874
    value: 0.038126092404127121
    value: -0.25426113605499268
    value: 0.99905019998550415
    value: 0.3873630166053772
    value: -0.01146940141916275
    value: 0.58011311292648315
    value: 0.32319143414497375
    value: -8.1976397285614214e-33
    value: 0.23829324543476105
    value: 1.9171000618767189e-37
    value: 0.013834686949849129
    value: 0.33105283975601196
    value: -0.20073606073856354
  }
}
layers {
  layer_name: "/encoder/features.1/conv/conv.1/Conv_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: -6.31664133
    max: 7.03474
    size: 1
    element_type: 1
    scale: 19.099147796630859
    zero_point: 4294967289
  }
  weights {
    min: -1.30428779
    max: 1.15499055
    size: 1
    element_type: 0
    scale: 98.137847900390625
    zero_point: 0
  }
  bias {
    min: -1.33785224
    max: 1.30645323
    size: 16
    element_type: 0
    scale: 95.675735473632812
    zero_point: 0
    value: -1.3378522396087646
    value: 0.25540754199028015
    value: -0.68642991781234741
    value: 0.31211474537849426
    value: 0.16421449184417725
    value: -0.29441887140274048
    value: -0.10748668760061264
    value: -0.96597439050674438
    value: -0.73849499225616455
    value: -0.599087119102478
    value: 1.3064532279968262
    value: 0.047917630523443222
    value: -0.594426155090332
    value: -0.0071165678091347218
    value: 0.68168443441390991
    value: 0.7500004768371582
  }
}
layers {
  layer_name: "/encoder/features.2/conv/conv.0/conv.0.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 5.74840593
    size: 1
    element_type: 1
    scale: 44.360122680664062
    zero_point: 4294967168
  }
  weights {
    min: -0.499343723
    max: 0.600860357
    size: 1
    element_type: 0
    scale: 213.02786254882812
    zero_point: 0
  }
  bias {
    min: -0.303739578
    max: 0.361441404
    size: 96
    element_type: 0
    scale: 354.13763427734375
    zero_point: 0
    value: 0.030131036415696144
    value: -0.011818457394838333
    value: 0.2038305401802063
    value: 0.23384381830692291
    value: 0.13955271244049072
    value: 0.13571055233478546
    value: 0.044755589216947556
    value: 0.14850780367851257
    value: -0.04841938242316246
    value: 0.05191359668970108
    value: -0.30373957753181458
    value: 0.046423856168985367
    value: 0.18864479660987854
    value: 0.10098820179700851
    value: 0.044252321124076843
    value: 0.0067449524067342281
    value: -0.00809588935226202
    value: 0.24073778092861176
    value: 0.12689799070358276
    value: 0.31976935267448425
    value: 0.30907049775123596
    value: 0.17407485842704773
    value: 0.17441880702972412
    value: 0.12172079086303711
    value: 0.04994775727391243
    value: -0.013227809220552444
    value: 0.0793500617146492
    value: -0.292103111743927
    value: 0.0834914892911911
    value: 0.13009071350097656
    value: -0.01049560122191906
    value: 0.11463773250579834
    value: 0.119136743247509
    value: -0.0048788231797516346
    value: -0.056647531688213348
    value: 0.13811029493808746
    value: 0.16124290227890015
    value: 0.1166597381234169
    value: 0.20894575119018555
    value: 0.031729463487863541
    value: 0.060108456760644913
    value: 0.032746240496635437
    value: 0.21045263111591339
    value: 0.10181383043527603
    value: 0.16742675006389618
    value: -0.012627708725631237
    value: 0.19810980558395386
    value: 0.18722674250602722
    value: 0.018273154273629189
    value: 0.14749714732170105
    value: -0.0022503826767206192
    value: -0.075955167412757874
    value: 0.0462348498404026
    value: -0.020752184092998505
    value: -0.097568593919277191
    value: 0.15208123624324799
    value: -0.051436707377433777
    value: 0.36144140362739563
    value: 0.096565909683704376
    value: 0.09768599271774292
    value: 0.0016906103119254112
    value: -0.057075969874858856
    value: 0.20881800353527069
    value: 0.24902832508087158
    value: -0.0038973286282271147
    value: 0.13348565995693207
    value: 0.06210954487323761
    value: 0.077448882162570953
    value: 0.056712843477725983
    value: 0.061983782798051834
    value: 0.079743348062038422
    value: 0.17236848175525665
    value: 0.15949958562850952
    value: 0.031575888395309448
    value: 0.0787748470902443
    value: 0.10784907639026642
    value: 0.10770256072282791
    value: -0.065379738807678223
    value: 0.18888562917709351
    value: 0.084254555404186249
    value: -0.076372802257537842
    value: 0.13201692700386047
    value: 0.041268814355134964
    value: -0.010245188139379025
    value: 0.085620127618312836
    value: -0.065988972783088684
    value: 0.14634494483470917
    value: 0.00405903672799468
    value: 0.20788456499576569
    value: 0.12683726847171783
    value: 0.15320837497711182
    value: -0.027161914855241776
    value: -0.019368883222341537
    value: -0.046399302780628204
    value: 0.14559191465377808
    value: 0.059004645794630051
  }
}
layers {
  layer_name: "/encoder/features.2/conv/conv.1/conv.1.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 5.27757263
    size: 1
    element_type: 1
    scale: 48.317668914794922
    zero_point: 4294967168
  }
  weights {
    min: -11.1786137
    max: 7.52956915
    size: 1
    element_type: 0
    scale: 11.450435638427734
    zero_point: 0
  }
  bias {
    min: -0.994238496
    max: 1.4224577
    size: 96
    element_type: 0
    scale: 89.985099792480469
    zero_point: 0
    value: 0.3709399402141571
    value: 0.38810312747955322
    value: -0.2414984405040741
    value: -0.26549017429351807
    value: 0.10278033465147018
    value: 0.093527115881443024
    value: 0.30400088429450989
    value: 0.15676227211952209
    value: 0.02017553336918354
    value: 0.047374848276376724
    value: -0.27703461050987244
    value: 0.43815624713897705
    value: 0.055704891681671143
    value: -0.29636919498443604
    value: -0.215543732047081
    value: 0.454043984413147
    value: 0.038282718509435654
    value: -0.99423849582672119
    value: 0.335427463054657
    value: 0.953777551651001
    value: -0.018287591636180878
    value: 0.0032992023043334484
    value: -0.067135460674762726
    value: 0.0062448866665363312
    value: 0.029989203438162804
    value: 0.044694840908050537
    value: -0.0023116047959774733
    value: -0.27272319793701172
    value: -0.012920411303639412
    value: -0.053222402930259705
    value: 0.39053767919540405
    value: -0.11783758550882339
    value: 0.032171770930290222
    value: 0.38934177160263062
    value: 0.52992111444473267
    value: -0.050134532153606415
    value: 0.61804699897766113
    value: 0.59964549541473389
    value: 0.016135971993207932
    value: 0.032956495881080627
    value: 0.54991555213928223
    value: -0.12377417832612991
    value: 0.14187492430210114
    value: -0.026450609788298607
    value: -0.0086552733555436134
    value: 0.046764742583036423
    value: 0.66354233026504517
    value: -0.22849605977535248
    value: -0.046749897301197052
    value: 0.09852985292673111
    value: -3.8111254464088482e-39
    value: 0.62897437810897827
    value: 0.5010911226272583
    value: -0.034209050238132477
    value: 0.58310908079147339
    value: 0.04749036580324173
    value: 0.052753787487745285
    value: 1.4224576950073242
    value: -0.0033188262023031712
    value: 0.35675054788589478
    value: 0.0047109085135161877
    value: 0.046806588768959045
    value: -0.001899205963127315
    value: 0.91278469562530518
    value: 0.30891475081443787
    value: -0.064155161380767822
    value: -0.035355377942323685
    value: 0.532130777835846
    value: 0.012799987569451332
    value: 0.0090020233765244484
    value: -0.0861421674489975
    value: 0.36110624670982361
    value: 0.03029143437743187
    value: 0.41314330697059631
    value: -0.013814193196594715
    value: 0.46741074323654175
    value: 0.30540916323661804
    value: 0.57074391841888428
    value: 0.011136681772768497
    value: 0.23018854856491089
    value: 0.37556132674217224
    value: -0.029075993224978447
    value: 0.38474899530410767
    value: 0.057520892471075058
    value: 0.48418691754341125
    value: -0.012247400358319283
    value: -0.37648841738700867
    value: 0.021440908312797546
    value: 0.54500186443328857
    value: -0.13744276762008667
    value: 0.20552252233028412
    value: 0.38490769267082214
    value: 0.53180688619613647
    value: 0.0529286153614521
    value: 0.42248934507369995
    value: 0.086756497621536255
  }
}
layers {
  layer_name: "/encoder/features.2/conv/conv.2/Conv_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: -3.59076047
    max: 4.65051
    size: 1
    element_type: 1
    scale: 27.308834075927734
    zero_point: 0
  }
  weights {
    min: -0.833378911
    max: 0.844189823
    size: 1
    element_type: 0
    scale: 151.62466430664062
    zero_point: 0
  }
  bias {
    min: -0.441423506
    max: 1.08385372
    size: 24
    element_type: 0
    scale: 118.09711456298828
    zero_point: 0
    value: -0.44142350554466248
    value: -0.27856224775314331
    value: -0.24568460881710052
    value: 0.30381536483764648
    value: 0.018605383113026619
    value: -0.31551659107208252
    value: 0.11077965050935745
    value: 0.19017559289932251
    value: -0.18915191292762756
    value: -0.33582991361618042
    value: 0.57412993907928467
    value: -0.32094857096672058
    value: 0.13870206475257874
    value: 1.0838537216186523
    value: 0.11136734485626221
    value: 0.43743634223937988
    value: 0.15096193552017212
    value: 0.17913421988487244
    value: -0.12268967926502228
    value: 0.012640940956771374
    value: -0.22810652852058411
    value: 0.29390907287597656
    value: 0.12200115621089935
    value: -0.14919734001159668
  }
}
layers {
  layer_name: "/encoder/features.3/conv/conv.0/conv.0.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 1.77671015
    size: 1
    element_type: 1
    scale: 143.52369689941406
    zero_point: 4294967168
  }
  weights {
    min: -0.294926137
    max: 0.294050246
    size: 1
    element_type: 0
    scale: 434.00698852539062
    zero_point: 0
  }
  bias {
    min: -0.192592293
    max: 0.50195092
    size: 144
    element_type: 0
    scale: 255.0050048828125
    zero_point: 0
    value: -0.063922099769115448
    value: 0.12555484473705292
    value: -0.076090581715106964
    value: -0.018169326707720757
    value: -0.18567487597465515
    value: 0.080415688455104828
    value: 0.13071446120738983
    value: 0.043669674545526505
    value: 0.11610046774148941
    value: 0.14991143345832825
    value: 0.20211412012577057
    value: 0.20176541805267334
    value: 0.14017570018768311
    value: 0.18033194541931152
    value: -0.093153007328510284
    value: -0.019118785858154297
    value: 0.037644866853952408
    value: 0.06595640629529953
    value: 0.17897613346576691
    value: 0.031605236232280731
    value: 0.21973034739494324
    value: 0.12708146870136261
    value: 0.027422988787293434
    value: -0.044840369373559952
    value: -0.19259229302406311
    value: 0.346791535615921
    value: -0.0029041932430118322
    value: 0.12354577332735062
    value: -0.046047583222389221
    value: 0.12103985249996185
    value: 0.046970855444669724
    value: 0.038221221417188644
    value: -0.081376984715461731
    value: 0.036752771586179733
    value: 0.052700769156217575
    value: 0.012889661826193333
    value: -0.028313925489783287
    value: 0.063136883080005646
    value: -0.13504970073699951
    value: 0.0031233788467943668
    value: 0.12600350379943848
    value: 0.16327497363090515
    value: 0.18124419450759888
    value: 0.0983363464474678
    value: 0.088088721036911011
    value: 0.1337541937828064
    value: 0.10495762526988983
    value: 0.18082244694232941
    value: 0.1208706796169281
    value: 0.0602683462202549
    value: -0.055108092725276947
    value: 0.18045884370803833
    value: -0.071304909884929657
    value: 0.1193891242146492
    value: 0.099840655922889709
    value: -0.06600576639175415
    value: -0.12152596563100815
    value: 0.19803228974342346
    value: -0.027201386168599129
    value: 0.050536502152681351
    value: 0.00093938159989193082
    value: -0.000612961477600038
    value: -0.06205400824546814
    value: 0.1218479722738266
    value: 0.1373935341835022
    value: 0.013153196312487125
    value: -0.039150968194007874
    value: 0.25758382678031921
    value: 0.027638919651508331
    value: 0.2061820924282074
    value: 0.12044839560985565
    value: -0.062484964728355408
    value: 0.13346539437770844
    value: 0.12276326864957809
    value: 0.062950201332569122
    value: -0.17588813602924347
    value: 0.053655996918678284
    value: -0.046875294297933578
    value: -0.00070974859409034252
    value: 0.0845160037279129
    value: -0.038987740874290466
    value: 0.11849775165319443
    value: -0.18473438918590546
    value: -0.12352658063173294
    value: 0.073355995118618011
    value: 0.2123991847038269
    value: -0.040281437337398529
    value: 0.1434607207775116
    value: 0.14714282751083374
    value: 0.12243056297302246
    value: 0.10871066898107529
    value: -0.073791541159152985
    value: -0.087520316243171692
    value: 0.19916881620883942
    value: -0.07903655618429184
    value: 0.14772467315196991
    value: 0.18307742476463318
    value: 0.10713054239749908
    value: 0.0813833698630333
    value: -0.026167208328843117
    value: 0.16301625967025757
    value: -0.041387796401977539
    value: 0.19408370554447174
    value: 0.12104260176420212
    value: -0.0331931971013546
    value: 0.090927384793758392
    value: 0.22742103040218353
    value: 0.10557606816291809
    value: -0.010046971030533314
    value: 0.0410284586250782
    value: 0.50195091962814331
    value: 0.052487198263406754
    value: 0.1615312397480011
    value: -0.046116359531879425
    value: 0.011282370425760746
    value: 0.091066822409629822
    value: 0.017644664272665977
    value: 0.14539934694766998
    value: 0.148418128490448
    value: -0.076018206775188446
    value: 0.25128564238548279
    value: 0.18727611005306244
    value: 0.16765736043453217
    value: 0.13568955659866333
    value: 0.14973829686641693
    value: 0.032454025000333786
    value: 0.095169976353645325
    value: 0.032953802496194839
    value: 0.067704059183597565
    value: -0.158106729388237
    value: 0.22478042542934418
    value: -0.1196729987859726
    value: -0.09631657600402832
    value: 0.016389725729823112
    value: -0.0077411266975104809
    value: 0.12219368666410446
    value: 0.096902571618556976
    value: 0.06551264226436615
    value: 0.15850721299648285
    value: 0.065720155835151672
    value: 0.24120549857616425
    value: 0.12003152817487717
    value: 0.0024577905423939228
    value: 0.015428126789629459
  }
}
layers {
  layer_name: "/encoder/features.3/conv/conv.1/conv.1.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 3.02956676
    size: 1
    element_type: 1
    scale: 84.170448303222656
    zero_point: 4294967168
  }
  weights {
    min: -3.97460294
    max: 4.56636238
    size: 1
    element_type: 0
    scale: 28.031064987182617
    zero_point: 0
  }
  bias {
    min: -0.510736
    max: 0.764975071
    size: 144
    element_type: 0
    scale: 167.32571411132812
    zero_point: 0
    value: 0.20846445858478546
    value: -0.014729979448020458
    value: 0.017624560743570328
    value: 0.012428515590727329
    value: -0.015222971327602863
    value: -0.021132364869117737
    value: 0.16591551899909973
    value: 0.043067179620265961
    value: -0.026181586086750031
    value: 0.13362213969230652
    value: 0.25230491161346436
    value: 0.23375315964221954
    value: 0.12318967282772064
    value: 0.36228311061859131
    value: -0.1227419301867485
    value: -0.002077875193208456
    value: -0.062981590628623962
    value: 0.034669704735279083
    value: 0.23481084406375885
    value: -1.3035563824814744e-05
    value: 0.098970644176006317
    value: -0.4034026563167572
    value: 0.077778607606887817
    value: -0.0563950277864933
    value: 0.17690494656562805
    value: 0.51442247629165649
    value: -2.16128567995906e-39
    value: 0.015762614086270332
    value: 0.01568053662776947
    value: 0.012747934088110924
    value: -0.12937803566455841
    value: 0.067465022206306458
    value: -0.082617007195949554
    value: 0.19021075963974
    value: -0.064850844442844391
    value: -0.010096589103341103
    value: -0.0055405036546289921
    value: 0.037400722503662109
    value: -0.0012178734177723527
    value: 0.028016533702611923
    value: 0.44339779019355774
    value: -0.12475449591875076
    value: -0.17575858533382416
    value: 0.11849462985992432
    value: 0.088013060390949249
    value: -0.11750602722167969
    value: 0.081816330552101135
    value: 0.0978417843580246
    value: 0.48278316855430603
    value: -0.040850121527910233
    value: 0.17936165630817413
    value: 0.28843271732330322
    value: 0.18158181011676788
    value: -0.04131472110748291
    value: -0.013542463071644306
    value: 0.30638012290000916
    value: 0.2109902948141098
    value: 0.51476842164993286
    value: 0.097680367529392242
    value: 0.13562151789665222
    value: -0.099829509854316711
    value: 2.8759095799246737e-12
    value: 0.21280635893344879
    value: -0.056250873953104019
    value: -0.013562249019742012
    value: -0.040297433733940125
    value: 0.379822701215744
    value: -0.042047139257192612
    value: -0.2035355269908905
    value: 0.050659064203500748
    value: -0.073701284825801849
    value: 0.13429710268974304
    value: 0.0706108957529068
    value: -0.279670774936676
    value: 0.11511193960905075
    value: 0.022615518420934677
    value: -0.0096446182578802109
    value: -0.027752982452511787
    value: -0.01323567982763052
    value: 0.035904813557863235
    value: 0.11918815970420837
    value: 0.030621893703937531
    value: 0.11415659636259079
    value: -0.055189963430166245
    value: -0.1761641800403595
    value: 0.2867133617401123
    value: -0.17097453773021698
    value: 0.0491616390645504
    value: 0.054434314370155334
    value: 0.12873397767543793
    value: 0.03148694708943367
    value: 0.13969020545482635
    value: -0.0040730414912104607
    value: -0.3451363742351532
    value: 0.061364904046058655
    value: -0.21480558812618256
    value: -0.015232806093990803
    value: 0.14609295129776
    value: -0.076857663691043854
    value: 0.13034388422966003
    value: 0.052923619747161865
    value: 0.069479107856750488
    value: -0.1257973313331604
    value: -0.015049404464662075
    value: -0.15713666379451752
    value: -0.062574036419391632
    value: 0.21645148098468781
    value: -0.033032678067684174
    value: -0.029376409947872162
    value: 0.063030369579792023
    value: 0.76497507095336914
    value: 0.19338054955005646
    value: -0.019575074315071106
    value: -0.031810622662305832
    value: -0.24849416315555573
    value: -0.040003366768360138
    value: 0.11118696630001068
    value: -0.015267955139279366
    value: 0.041624724864959717
    value: 0.063800938427448273
    value: 0.27825054526329041
    value: -0.13090859353542328
    value: 0.070287488400936127
    value: 0.0978231355547905
    value: 0.025269612669944763
    value: -0.12244661897420883
    value: -0.51073598861694336
    value: 0.011876028962433338
    value: -0.19173479080200195
    value: 0.18728171288967133
    value: 0.041213821619749069
    value: -0.073122493922710419
    value: -0.061936914920806885
    value: -0.14648428559303284
    value: -0.025283481925725937
    value: -0.0970977246761322
    value: 0.18523114919662476
    value: 0.19557015597820282
    value: -0.27857217192649841
    value: -0.40938812494277954
    value: -0.4788895845413208
    value: 0.12458682060241699
    value: -0.060594052076339722
    value: 0.080329403281211853
  }
}
layers {
  layer_name: "/encoder/features.3/conv/conv.2/Conv_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: -4.28403425
    max: 3.37974691
    size: 1
    element_type: 1
    scale: 29.644954681396484
    zero_point: 0
  }
  weights {
    min: -0.864789784
    max: 0.790896
    size: 1
    element_type: 0
    scale: 148.01284790039062
    zero_point: 0
  }
  bias {
    min: -0.999419153
    max: 0.642616034
    size: 24
    element_type: 0
    scale: 128.07438659667969
    zero_point: 0
    value: -0.14917179942131042
    value: -0.48755744099617004
    value: 0.32376590371131897
    value: -0.37314435839653015
    value: -0.80793029069900513
    value: 0.35390967130661011
    value: -0.10375703126192093
    value: 0.2698800265789032
    value: -0.085022985935211182
    value: -0.008493250235915184
    value: -0.99941915273666382
    value: -0.50543612241745
    value: 0.21880339086055756
    value: -0.57320094108581543
    value: 0.44773614406585693
    value: -0.17811530828475952
    value: 0.0067345430143177509
    value: -0.048196800053119659
    value: -0.56654495000839233
    value: 0.19147820770740509
    value: 0.31670075654983521
    value: 0.47697827219963074
    value: -0.99753051996231079
    value: 0.64261603355407715
  }
}
layers {
  layer_name: "/encoder/features.3/add/Add_output_0"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: -6.30227661
    max: 5.84113503
    size: 1
    element_type: 1
    scale: 13.654417037963867
    zero_point: 0
  }
}
layers {
  layer_name: "/decoders.0/shortcut/shortcut.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 1.64045835
    size: 1
    element_type: 0
    scale: 155.44436645507812
    zero_point: 0
  }
  weights {
    min: -0.18880631
    max: 0.2200495
    size: 1
    element_type: 0
    scale: 581.68731689453125
    zero_point: 0
  }
  bias {
    min: -0.333632708
    max: 0.0949600413
    size: 48
    element_type: 0
    scale: 383.65542602539062
    zero_point: 0
    value: -0.0647360160946846
    value: -0.20228986442089081
    value: 0.058617644011974335
    value: -0.044645469635725021
    value: 0.018982052803039551
    value: 0.019734470173716545
    value: -0.0071029309183359146
    value: -0.01090154517441988
    value: 0.047698352485895157
    value: -0.00955905206501484
    value: -0.070168599486351013
    value: 0.046585295349359512
    value: -0.026112165302038193
    value: -0.039301842451095581
    value: -0.12001471221446991
    value: -6.38695782981813e-05
    value: -0.0017697274452075362
    value: -0.050418637692928314
    value: 0.004120904952287674
    value: -0.3336327075958252
    value: 0.08600945770740509
    value: 0.0949600413441658
    value: 0.031833663582801819
    value: 0.032099239528179169
    value: 0.0520995669066906
    value: -0.058131702244281769
    value: 0.0090516321361064911
    value: 0.021121382713317871
    value: -0.017789220437407494
    value: -0.15979765355587006
    value: 0.037514176219701767
    value: -0.013814821839332581
    value: -0.047840096056461334
    value: 0.00080987374531105161
    value: -0.09520016610622406
    value: 0.0042576664127409458
    value: 0.016062866896390915
    value: 0.0041269753128290176
    value: 0.014021707698702812
    value: -0.0076164952479302883
    value: 0.048428837209939957
    value: 0.026043228805065155
    value: -0.055595159530639648
    value: 0.0061814957298338413
    value: -0.03425757959485054
    value: -0.19361355900764465
    value: -0.031986311078071594
    value: 0.015417622402310371
  }
}
layers {
  layer_name: "/encoder/features.4/conv/conv.0/conv.0.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 2.7197721
    size: 1
    element_type: 1
    scale: 93.757858276367188
    zero_point: 4294967168
  }
  weights {
    min: -0.265834302
    max: 0.242359608
    size: 1
    element_type: 0
    scale: 481.50296020507812
    zero_point: 0
  }
  bias {
    min: -0.258961409
    max: 0.267943114
    size: 144
    element_type: 0
    scale: 477.71334838867188
    zero_point: 0
    value: 0.017705798149108887
    value: 0.23822745680809021
    value: 0.01616828516125679
    value: 0.18780526518821716
    value: -0.010151361115276814
    value: -0.051371380686759949
    value: 0.0077987792901694775
    value: -0.057367376983165741
    value: 0.12106309086084366
    value: -0.010251910425722599
    value: -0.15597639977931976
    value: -0.11667707562446594
    value: 0.049481935799121857
    value: -0.14926204085350037
    value: -0.0687049850821495
    value: -0.068240560591220856
    value: 0.0356498546898365
    value: 0.063197731971740723
    value: 0.023455696180462837
    value: -0.1145603135228157
    value: -0.0087518263608217239
    value: -0.043514452874660492
    value: -0.12630614638328552
    value: -0.067121312022209167
    value: 0.040294818580150604
    value: -0.077751591801643372
    value: 0.25343793630599976
    value: 0.066263139247894287
    value: -0.11385150253772736
    value: -0.16993750631809235
    value: 0.078084386885166168
    value: -0.058252125978469849
    value: 0.12409762293100357
    value: -0.12746910750865936
    value: -0.074234426021575928
    value: -0.06416737288236618
    value: 0.11285755783319473
    value: 0.10584227740764618
    value: -0.20223540067672729
    value: -0.094962604343891144
    value: -0.028077559545636177
    value: -0.025161866098642349
    value: -0.17459611594676971
    value: 0.097629435360431671
    value: 0.050932608544826508
    value: -0.15674464404582977
    value: 0.18258547782897949
    value: 0.089224144816398621
    value: -0.019824869930744171
    value: 0.10896526277065277
    value: 0.041506979614496231
    value: 0.0031961395870894194
    value: 0.036572571843862534
    value: -0.13504444062709808
    value: 0.1798446923494339
    value: 0.0003317554946988821
    value: -0.032608427107334137
    value: 0.020064983516931534
    value: 0.090993046760559082
    value: 0.073970161378383636
    value: -0.083511069416999817
    value: 0.057723432779312134
    value: 0.17445653676986694
    value: 0.17214173078536987
    value: -0.062384050339460373
    value: -0.19316144287586212
    value: -0.10553247481584549
    value: -0.011183495633304119
    value: -0.12148631364107132
    value: -0.077537335455417633
    value: 0.14863333106040955
    value: 0.16423185169696808
    value: -0.0950155109167099
    value: -0.098027631640434265
    value: -0.25896140933036804
    value: -0.033526301383972168
    value: 0.13083538413047791
    value: -0.0060248835943639278
    value: -0.1875884085893631
    value: 0.15700559318065643
    value: -0.11357434093952179
    value: 0.15747025609016418
    value: 0.13717791438102722
    value: -0.16483166813850403
    value: 0.050191137939691544
    value: -0.15325555205345154
    value: 0.17225806415081024
    value: -0.09756237268447876
    value: -0.0017634261166676879
    value: -0.20120337605476379
    value: -0.166703000664711
    value: 0.033911988139152527
    value: 0.2679431140422821
    value: -0.069912068545818329
    value: -0.22615255415439606
    value: 0.11264824867248535
    value: -0.12989754974842072
    value: -0.0032756223808974028
    value: 0.13419611752033234
    value: 0.000667399785015732
    value: 0.040854185819625854
    value: 0.18822778761386871
    value: -0.13976742327213287
    value: -0.096742920577526093
    value: -0.25512772798538208
    value: -0.024964179843664169
    value: 0.14717660844326019
    value: 0.13086007535457611
    value: 0.092705331742763519
    value: 0.11213938146829605
    value: 0.20318888127803802
    value: 0.014961674809455872
    value: -0.12539975345134735
    value: -0.0054999720305204391
    value: 0.060015607625246048
    value: 0.20902079343795776
    value: 0.15246205031871796
    value: -0.0394916832447052
    value: 0.18198637664318085
    value: 0.1464124321937561
    value: 0.13611489534378052
    value: -0.023547885939478874
    value: 0.11311394721269608
    value: 0.02682853676378727
    value: 0.213045135140419
    value: -0.065875053405761719
    value: -0.06502106785774231
    value: -0.032557141035795212
    value: 0.027278415858745575
    value: -0.034614037722349167
    value: -0.012478633783757687
    value: 0.18392382562160492
    value: 0.10234452784061432
    value: -0.10993404686450958
    value: 0.11309683322906494
    value: 0.1092282310128212
    value: 0.023551544174551964
    value: -0.081291750073432922
    value: 0.0039031847845762968
    value: -0.21787279844284058
    value: 0.090253546833992
    value: -0.073350377380847931
    value: -0.055304709821939468
    value: -0.057631585747003555
  }
}
layers {
  layer_name: "/encoder/features.4/conv/conv.1/conv.1.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 3.26514411
    size: 1
    element_type: 1
    scale: 78.097625732421875
    zero_point: 4294967168
  }
  weights {
    min: -5.37913
    max: 4.53587675
    size: 1
    element_type: 0
    scale: 23.795669555664062
    zero_point: 0
  }
  bias {
    min: -0.410590321
    max: 1.26642132
    size: 144
    element_type: 0
    scale: 101.07221221923828
    zero_point: 0
    value: 0.71880197525024414
    value: -0.16807235777378082
    value: 0.43005064129829407
    value: 0.67073917388916016
    value: 0.35359939932823181
    value: -0.0137203773483634
    value: 0.589408278465271
    value: -0.011773757636547089
    value: 0.65389573574066162
    value: 0.39547854661941528
    value: -0.0091186240315437317
    value: -0.0095151681452989578
    value: 0.25638195872306824
    value: -0.038397204130887985
    value: 0.45088386535644531
    value: -0.17082929611206055
    value: 0.02669757604598999
    value: 0.045921523123979568
    value: 0.36866474151611328
    value: -0.152096688747406
    value: 0.45581939816474915
    value: 0.46845996379852295
    value: 0.6951485276222229
    value: -0.020159663632512093
    value: -0.032173942774534225
    value: 0.0013752230443060398
    value: 0.10236790776252747
    value: 0.56282144784927368
    value: -0.13386121392250061
    value: 0.0018057270208373666
    value: 0.37522614002227783
    value: 0.43070507049560547
    value: -0.12908162176609039
    value: 0.0073437304235994816
    value: -0.023489721119403839
    value: -0.019544750452041626
    value: -0.03619658574461937
    value: 0.66945701837539673
    value: 0.47406485676765442
    value: -0.0064732916653156281
    value: 0.4626234769821167
    value: 0.35876476764678955
    value: -0.088738471269607544
    value: 0.65707772970199585
    value: -0.022752305492758751
    value: 0.507552444934845
    value: 0.812809407711029
    value: 0.669485330581665
    value: -0.067416302859783173
    value: -0.063805699348449707
    value: 0.041312549263238907
    value: 0.43021360039711
    value: 0.60760730504989624
    value: -0.025251751765608788
    value: -0.092942848801612854
    value: -0.026960160583257675
    value: 0.027381811290979385
    value: 0.67957204580307007
    value: 0.015924938023090363
    value: -0.1812245100736618
    value: 0.43759006261825562
    value: -0.013750927522778511
    value: -0.30374798178672791
    value: -0.17986202239990234
    value: -0.052890319377183914
    value: 0.41705915331840515
    value: -0.032549887895584106
    value: 0.44154301285743713
    value: 0.017100168392062187
    value: -0.049210913479328156
    value: 0.79825758934021
    value: -0.030741466209292412
    value: 0.054470244795084
    value: -0.014659635722637177
    value: -0.017122764140367508
    value: 0.021676156669855118
    value: 0.42562249302864075
    value: 0.43766772747039795
    value: -0.0815555527806282
    value: 0.31700754165649414
    value: 0.3607061505317688
    value: -0.10987497121095657
    value: -0.023548990488052368
    value: 0.001386496820487082
    value: 0.69598519802093506
    value: -0.076660439372062683
    value: -0.11839351058006287
    value: 0.046794421970844269
    value: -0.065705776214599609
    value: -0.045142427086830139
    value: -0.020051471889019012
    value: 0.40313556790351868
    value: 1.2664213180541992
    value: -0.052756469696760178
    value: -0.004433345515280962
    value: 0.10782788693904877
    value: 0.30709889531135559
    value: 2.4766540807338826e-21
    value: -0.077486976981163025
    value: 0.42131355404853821
    value: 0.002954212948679924
    value: 0.23117423057556152
    value: 0.40157631039619446
    value: -0.0098243122920393944
    value: 0.022317938506603241
    value: -0.0052149030379951
    value: 0.043736614286899567
    value: 0.3911023736000061
    value: -0.015362005680799484
    value: -0.20937888324260712
    value: -0.41059032082557678
    value: 0.6039503812789917
    value: -0.024452947080135345
    value: 0.39681333303451538
    value: -0.28791970014572144
    value: 0.300997793674469
    value: -0.15596446394920349
    value: 0.4398135244846344
    value: -0.074615508317947388
    value: 0.67401736974716187
    value: 0.11968358606100082
    value: 0.52638131380081177
    value: -0.0801033079624176
    value: 0.00687748659402132
    value: 0.696898877620697
    value: 0.027612024918198586
    value: 0.42022931575775146
    value: 0.32770267128944397
    value: -0.38495612144470215
    value: 0.47992622852325439
    value: 0.050955973565578461
    value: -0.19832587242126465
    value: -0.039678622037172318
    value: -0.0072702113538980484
    value: 0.439237505197525
    value: -0.075470529496669769
    value: 0.55063349008560181
    value: -0.017880680039525032
    value: -0.016935961320996284
    value: 0.023784687742590904
    value: -0.058635152876377106
    value: -0.034672215580940247
    value: 0.033798817545175552
    value: 0.032937534153461456
  }
}
layers {
  layer_name: "/encoder/features.4/conv/conv.2/Conv_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: -3.68506
    max: 3.39853072
    size: 1
    element_type: 1
    scale: 34.463481903076172
    zero_point: 0
  }
  weights {
    min: -0.593868315
    max: 0.730149269
    size: 1
    element_type: 0
    scale: 175.30662536621094
    zero_point: 0
  }
  bias {
    min: -0.839105546
    max: 0.795063
    size: 32
    element_type: 0
    scale: 152.54338073730469
    zero_point: 0
    value: 0.624284029006958
    value: -0.10214507579803467
    value: -0.68069571256637573
    value: 0.260911762714386
    value: 0.5247032642364502
    value: -0.61880624294281006
    value: -0.12501205503940582
    value: -0.022241098806262016
    value: -0.050917100161314011
    value: -0.71961641311645508
    value: 0.449806809425354
    value: 0.25857779383659363
    value: 0.16588854789733887
    value: 0.085981272161006927
    value: -0.089954845607280731
    value: -0.2211889773607254
    value: 0.280895471572876
    value: -0.4231795072555542
    value: 0.1888999342918396
    value: -0.41164153814315796
    value: 0.00239268084987998
    value: -0.26812228560447693
    value: -0.52553504705429077
    value: 0.60894995927810669
    value: -0.40277817845344543
    value: 0.30923601984977722
    value: -0.15672753751277924
    value: -0.83910554647445679
    value: 0.79506301879882812
    value: -0.76737397909164429
    value: -0.24505165219306946
    value: -0.033560473471879959
  }
}
layers {
  layer_name: "/encoder/features.5/conv/conv.0/conv.0.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 1.30042815
    size: 1
    element_type: 1
    scale: 196.08926391601562
    zero_point: 4294967168
  }
  weights {
    min: -0.185583949
    max: 0.211948052
    size: 1
    element_type: 0
    scale: 603.92156982421875
    zero_point: 0
  }
  bias {
    min: -0.122881323
    max: 0.236012712
    size: 192
    element_type: 0
    scale: 542.34368896484375
    zero_point: 0
    value: 0.14218121767044067
    value: 0.058536134660243988
    value: 0.11593367159366608
    value: 0.041116561740636826
    value: -0.0031719161197543144
    value: 0.13916689157485962
    value: 0.15709406137466431
    value: 0.15952616930007935
    value: -0.10696360468864441
    value: -0.09271906316280365
    value: 0.14398850500583649
    value: 0.10183436423540115
    value: 0.096667438745498657
    value: 0.064579933881759644
    value: -0.057945463806390762
    value: -0.12288132309913635
    value: 0.11023685336112976
    value: 0.14874915778636932
    value: 0.05083085224032402
    value: 0.18726491928100586
    value: 0.21290825307369232
    value: 0.089999347925186157
    value: 0.10070335865020752
    value: 0.11570600420236588
    value: 0.15286365151405334
    value: 0.17187096178531647
    value: -0.043952729552984238
    value: 0.024963526055216789
    value: 0.0814141184091568
    value: -0.056512132287025452
    value: -0.044916588813066483
    value: 0.072602078318595886
    value: -0.060713913291692734
    value: -0.090517282485961914
    value: -0.032250005751848221
    value: 0.12104953080415726
    value: 0.16050399839878082
    value: 0.1112024262547493
    value: 0.15820075571537018
    value: 0.080277055501937866
    value: 0.12173611670732498
    value: 0.19025298953056335
    value: 0.11496514827013016
    value: 0.11193673312664032
    value: 0.13476331532001495
    value: 0.10355968773365021
    value: 0.0789160504937172
    value: 0.13604424893856049
    value: 0.10599704831838608
    value: 0.086487390100955963
    value: 0.12602312862873077
    value: 0.11059053242206573
    value: 0.11652832478284836
    value: -0.044021476060152054
    value: 0.18518394231796265
    value: 0.20219887793064117
    value: 0.16677376627922058
    value: 0.12514154613018036
    value: 0.077748760581016541
    value: 0.035615421831607819
    value: 0.12809209525585175
    value: -0.054506838321685791
    value: 0.15401649475097656
    value: 0.060402918606996536
    value: -0.07498728483915329
    value: 0.06102927029132843
    value: 0.13367211818695068
    value: 0.14197263121604919
    value: -0.017245957627892494
    value: 0.16700562834739685
    value: 0.11335094273090363
    value: -0.0031719161197543144
    value: 0.053581926971673965
    value: -0.0056193340569734573
    value: -0.057468399405479431
    value: 0.1256977915763855
    value: 0.18444313108921051
    value: 0.10477646440267563
    value: 0.17189262807369232
    value: 0.031333528459072113
    value: -0.046239420771598816
    value: 0.097576193511486053
    value: 0.0037389451172202826
    value: 0.0993567407131195
    value: -0.069549262523651123
    value: 0.039988055825233459
    value: 0.12548868358135223
    value: 0.10723830759525299
    value: -0.0027357304934412241
    value: 0.12867262959480286
    value: 0.068219795823097229
    value: -0.0031719161197543144
    value: 0.12541812658309937
    value: 0.051779545843601227
    value: -0.030766194686293602
    value: 0.039752591401338577
    value: 0.11888783425092697
    value: 0.14209593832492828
    value: 0.15203216671943665
    value: 0.16816496849060059
    value: 0.089860513806343079
    value: 0.0962897390127182
    value: 0.098339349031448364
    value: 0.088814832270145416
    value: -0.095454983413219452
    value: -0.0031719161197543144
    value: 0.10081902891397476
    value: 0.12994469702243805
    value: 0.17532935738563538
    value: 0.11038636416196823
    value: 0.050451092422008514
    value: 0.14714299142360687
    value: 0.078876852989196777
    value: 0.1340128630399704
    value: 0.12737485766410828
    value: 0.10496814548969269
    value: 0.054323874413967133
    value: 0.17938758432865143
    value: 0.098457157611846924
    value: 0.085427567362785339
    value: 0.1302201896905899
    value: 0.1608552485704422
    value: 0.0042967991903424263
    value: 0.030140843242406845
    value: -0.0010720171267166734
    value: 0.15782248973846436
    value: -0.045774415135383606
    value: 0.097602576017379761
    value: 0.12207857519388199
    value: 0.10117123275995255
    value: 0.14759907126426697
    value: 0.022105999290943146
    value: 0.096336536109447479
    value: 0.14371739327907562
    value: 0.16963456571102142
    value: -0.0031719161197543144
    value: 0.14987941086292267
    value: 0.033847101032733917
    value: 0.1176331639289856
    value: 0.064387224614620209
    value: -0.056697092950344086
    value: 0.11412736773490906
    value: 0.135590597987175
    value: 0.16924574971199036
    value: 0.10379242897033691
    value: -0.06029709056019783
    value: 0.01362009160220623
    value: 0.09803348034620285
    value: 0.13051067292690277
    value: 0.081276983022689819
    value: 0.2046365886926651
    value: 0.22118037939071655
    value: 0.0521693080663681
    value: 0.075825810432434082
    value: 0.15016637742519379
    value: 0.0446106381714344
    value: 0.078147195279598236
    value: 0.18764001131057739
    value: 0.19104847311973572
    value: 0.082939885556697845
    value: 0.083409003913402557
    value: 0.13924875855445862
    value: 0.15300850570201874
    value: -0.059868834912776947
    value: 0.15853844583034515
    value: -0.005247113760560751
    value: 0.099887199699878693
    value: 0.13469420373439789
    value: 0.097704097628593445
    value: 0.046607151627540588
    value: -0.087833017110824585
    value: 0.058964710682630539
    value: 0.07913564145565033
    value: 0.12325851619243622
    value: 0.069677464663982391
    value: 0.1411418616771698
    value: 0.23601271212100983
    value: 0.059183370321989059
    value: -0.055013775825500488
    value: 0.018655044957995415
    value: -0.069085240364074707
    value: 0.11251050233840942
    value: 0.0767221450805664
    value: 0.1736254096031189
    value: 0.16006074845790863
    value: 0.14876939356327057
    value: 0.15331614017486572
    value: 0.17129717767238617
    value: 0.16452233493328094
    value: 0.086697958409786224
    value: 0.16165657341480255
    value: 0.023205883800983429
  }
}
layers {
  layer_name: "/encoder/features.5/conv/conv.1/conv.1.2/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 1.85100806
    size: 1
    element_type: 1
    scale: 137.76277160644531
    zero_point: 4294967168
  }
  weights {
    min: -5.02491
    max: 4.38924551
    size: 1
    element_type: 0
    scale: 25.473093032836914
    zero_point: 0
  }
  bias {
    min: -1.12756371
    max: 0.65394485
    size: 192
    element_type: 0
    scale: 113.51908111572266
    zero_point: 0
    value: -0.17364537715911865
    value: -0.0715242251753807
    value: -0.10688836872577667
    value: -0.30299046635627747
    value: -6.10361750417957e-39
    value: 0.067909993231296539
    value: 0.026512868702411652
    value: -0.03410714864730835
    value: 0.08115716278553009
    value: 0.12274700403213501
    value: 0.060064446181058884
    value: -0.049629345536231995
    value: -0.073075965046882629
    value: -0.0716361552476883
    value: -0.09683942049741745
    value: 0.092893056571483612
    value: 0.006028586532920599
    value: 0.006667762529104948
    value: -0.080200888216495514
    value: -0.12634606659412384
    value: -0.078152328729629517
    value: 0.044767260551452637
    value: 0.26509168744087219
    value: -0.040828332304954529
    value: 0.0094809923321008682
    value: 0.18692266941070557
    value: -0.18967783451080322
    value: -0.16274318099021912
    value: -0.052836798131465912
    value: 0.27815508842468262
    value: 0.0935617983341217
    value: -0.061013910919427872
    value: 0.15976497530937195
    value: -0.070949099957942963
    value: -0.15169946849346161
    value: 0.035289958119392395
    value: -0.11327957361936569
    value: -0.0050319046713411808
    value: 0.10425031185150146
    value: -0.019744651392102242
    value: -0.008434598334133625
    value: 0.09061247855424881
    value: 0.036961894482374191
    value: 0.061088252812623978
    value: 0.11507511138916016
    value: 0.023828223347663879
    value: -0.029773985967040062
    value: -0.095437169075012207
    value: -0.050175335258245468
    value: -0.012548526749014854
    value: -0.0651148110628128
    value: -0.033624473959207535
    value: -0.014219306409358978
    value: -0.1653529554605484
    value: 0.28740474581718445
    value: -0.042204193770885468
    value: 0.36190474033355713
    value: -0.084376238286495209
    value: 0.18381159007549286
    value: -0.10428420454263687
    value: 0.11048281937837601
    value: -0.036730032414197922
    value: 0.090006418526172638
    value: -0.0030146562494337559
    value: 0.19670121371746063
    value: 0.133098766207695
    value: 0.00068464572541415691
    value: 0.12531417608261108
    value: 0.26488202810287476
    value: 0.2994379997253418
    value: 0.049767691642045975
    value: -8.8777302389448731e-40
    value: 0.17944730818271637
    value: 0.12273464351892471
    value: 0.14119167625904083
    value: -0.12766183912754059
    value: 0.14578279852867126
    value: -0.046978689730167389
    value: 0.30997306108474731
    value: -0.10225484520196915
    value: -0.0064990958198904991
    value: 0.171673983335495
    value: -0.13868777453899384
    value: -0.16381701827049255
    value: -0.19362278282642365
    value: 0.098138988018035889
    value: -1.1275637149810791
    value: -0.095400527119636536
    value: 0.18611924350261688
    value: 0.013117310591042042
    value: -0.2196582704782486
    value: 2.9066153136564653e-39
    value: -0.039134487509727478
    value: -0.021391641348600388
    value: 0.14078755676746368
    value: 0.11356714367866516
    value: 0.026418160647153854
    value: -0.387224018573761
    value: 0.0078547326847910881
    value: -0.12637099623680115
    value: -0.14040930569171906
    value: 0.010210143402218819
    value: 0.25134092569351196
    value: -0.006023782305419445
    value: -0.14484108984470367
    value: 6.0639509485499269e-40
    value: 0.16032229363918304
    value: -0.0440191924571991
    value: 0.2563287615776062
    value: 0.0023854223545640707
    value: -0.38108643889427185
    value: -0.051709078252315521
    value: -0.0056623290292918682
    value: 0.43163558840751648
    value: 0.039189383387565613
    value: 0.12152688950300217
    value: 0.22369247674942017
    value: -0.019600437954068184
    value: 0.04035210981965065
    value: -0.12760837376117706
    value: -0.10159321874380112
    value: -0.065385058522224426
    value: -0.11688598245382309
    value: 0.0036386707797646523
    value: -8.3747799806133116e-08
    value: -0.020429544150829315
    value: 0.11995145678520203
    value: -0.15106286108493805
    value: 0.0067684995010495186
